# 第3章 數據分析庫 pandas
在這一章中你會學到 :

* pandas簡介
* pandas的操作
* 實際演練

## 3.1 pandas庫

pandas is well suited for(適合應用的場景):

* Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet (數據中包含不同類型)
* Ordered and unordered (not necessarily fixed-frequency) time series data. (有序或無序數據)
* Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels (數據形式類似矩陣)
* Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure (統計數據)

The two primary data structures of pandas
- **Series** (1-dimensional) 
- **DataFrame** (2-dimensional)

### 3.1.1 導入pandas

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

### 3.1.2 Series

- Series 中數據可以是任意型態
- Series 中數據必須統一型態
- 數據一般包含索引

### 3.1.3 創建pandas中的Series

- 從 list創建
- 從 dict創建
- 從 NumPy Arrays創建
- 從外部讀進檔案

####  從 list創建

In [2]:
# define the data and index as lists
temperature = [33, 19, 15, 89, 11, -5, 9]
days = ['Mon','Tue','Wed','Thu','Fri','Sat','Sun']

# 創建series
series_from_list = pd.Series(temperature,index=days)
series_from_list

Mon    33
Tue    19
Wed    15
Thu    89
Fri    11
Sat    -5
Sun     9
dtype: int64

#### 從 dict創建

In [3]:
# from a dictionary
my_dict = {'Mon': 33, 'Tue': 19, 'Wed': 15, 'Thu': 89, 'Fri': 11, 'Sat': -5, 'Sun': 9}
series_from_dict = pd.Series(my_dict)
series_from_dict

Mon    33
Tue    19
Wed    15
Thu    89
Fri    11
Sat    -5
Sun     9
dtype: int64

In [4]:
my_array=np.linspace(0,10,15)
series_from_ndarray = pd.Series(my_array)
series_from_ndarray

0      0.000000
1      0.714286
2      1.428571
3      2.142857
4      2.857143
5      3.571429
6      4.285714
7      5.000000
8      5.714286
9      6.428571
10     7.142857
11     7.857143
12     8.571429
13     9.285714
14    10.000000
dtype: float64

與 Numpy 類似 pandas Series可以執行向量操作

In [5]:
series_from_list

Mon    33
Tue    19
Wed    15
Thu    89
Fri    11
Sat    -5
Sun     9
dtype: int64

In [6]:
series_from_list*2

Mon     66
Tue     38
Wed     30
Thu    178
Fri     22
Sat    -10
Sun     18
dtype: int64

In [7]:
np.exp(series_from_list)

Mon    2.146436e+14
Tue    1.784823e+08
Wed    3.269017e+06
Thu    4.489613e+38
Fri    5.987414e+04
Sat    6.737947e-03
Sun    8.103084e+03
dtype: float64

### 3.1.4 DataFrame

DataFrame 包含了兩個個索引，與Excel等表格類似

In [8]:
file_url=r"HR-Employee-Attrition.xlsx"

In [9]:
data = pd.read_excel(io=file_url,index_col='EmployeeNumber')

In [10]:
data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked', 'Over18',
       'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [11]:
data.index

Int64Index([   1,    2,    4,    5,    7,    8,   10,   11,   12,   13,
            ...
            2054, 2055, 2056, 2057, 2060, 2061, 2062, 2064, 2065, 2068],
           dtype='int64', name='EmployeeNumber', length=1470)

In [12]:
data.values

array([[41, 'Yes', 'Travel_Rarely', ..., 4, 0, 5],
       [49, 'No', 'Travel_Frequently', ..., 7, 1, 7],
       [37, 'Yes', 'Travel_Rarely', ..., 0, 0, 0],
       ...,
       [27, 'No', 'Travel_Rarely', ..., 2, 0, 3],
       [49, 'No', 'Travel_Frequently', ..., 6, 0, 8],
       [34, 'No', 'Travel_Rarely', ..., 3, 1, 2]], dtype=object)

## 3.3 Pandas 操作

### 首先我們要檢查數據

In [13]:
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EnvironmentSatisfaction,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,...,1,80,0,8,0,1,6,4,0,5
2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,3,...,4,80,1,10,3,3,10,7,1,7
4,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
5,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,4,...,3,80,0,8,3,3,8,7,3,0
7,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,1,...,4,80,1,6,3,3,2,2,2,2

In [14]:
data.tail()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EnvironmentSatisfaction,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
2061,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,3,...,3,80,1,17,3,3,5,2,0,3
2062,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,4,...,1,80,1,9,5,3,7,7,1,7
2064,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2,...,2,80,1,6,0,3,6,2,0,3
2065,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,4,...,4,80,0,17,3,2,9,6,0,8
2068,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2,...,1,80,0,6,3,4,4,3,1,2

### 3.2.2 數據的選取、清洗、刪除

In [15]:
# Getting one column: .head() is just to print the first 5 values
data['Age'].head()

EmployeeNumber
1    41
2    49
4    37
5    33
7    27
Name: Age, dtype: int64

In [16]:
# 選取多行
data[['Age','Gender','YearsAtCompany']].head()

                Age  Gender  YearsAtCompany
EmployeeNumber
1                41  Female               6
2                49    Male              10
4                37    Male               0
5                33  Female               8
7                27    Male               2

In [17]:
# 新增一行
data["AgeInMonths"]=12*data['Age']
data["AgeInMonths"].head()

EmployeeNumber
1    492
2    588
4    444
5    396
7    324
Name: AgeInMonths, dtype: int64

In [18]:
# 刪除特定行
del data['AgeInMonths']

data.drop('EmployeeCount',axis=1,inplace=True)

In [19]:
data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked', 'Over18',
       'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

### 3.2.3  DataFrame的Slices

In [20]:
data['BusinessTravel'][10:15]

EmployeeNumber
14    Travel_Rarely
15    Travel_Rarely
16    Travel_Rarely
18    Travel_Rarely
19    Travel_Rarely
Name: BusinessTravel, dtype: object

In [21]:
data[10:15]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
14,35,No,Travel_Rarely,809,Research & Development,16,3,Medical,1,Male,...,3,80,1,6,5,3,5,4,0,3
15,29,No,Travel_Rarely,153,Research & Development,15,2,Life Sciences,4,Female,...,4,80,0,10,3,3,9,5,0,8
16,31,No,Travel_Rarely,670,Research & Development,26,1,Life Sciences,1,Male,...,4,80,1,5,1,2,5,2,4,3
18,34,No,Travel_Rarely,1346,Research & Development,19,2,Medical,2,Male,...,3,80,1,3,2,3,2,2,1,2
19,28,Yes,Travel_Rarely,103,Research & Development,24,3,Life Sciences,3,Male,...,2,80,0,6,4,3,4,2,0,3

### 3.2.4 基於標記選擇數據

In [22]:
selected_EmployeeNumbers = [15, 94, 337, 1120]

In [23]:
data['YearsAtCompany'].loc[selected_EmployeeNumbers]

EmployeeNumber
15      9
94      5
337     2
1120    7
Name: YearsAtCompany, dtype: int64

In [24]:
data.loc[selected_EmployeeNumbers]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
15,29,No,Travel_Rarely,153,Research & Development,15,2,Life Sciences,4,Female,...,4,80,0,10,3,3,9,5,0,8
94,29,No,Travel_Rarely,1328,Research & Development,2,3,Life Sciences,3,Male,...,4,80,1,6,3,3,5,4,0,4
337,31,No,Travel_Frequently,1327,Research & Development,3,4,Medical,2,Male,...,1,80,1,9,3,3,2,2,2,2
1120,29,No,Travel_Rarely,1107,Research & Development,28,4,Life Sciences,3,Female,...,1,80,1,11,1,3,7,5,1,7

## 3.3 數據集

### 3.3.1 各部門有多少員工呢?

In [25]:
data['Department'].value_counts()

Research & Development    961
Sales                     446
Human Resources            63
Name: Department, dtype: int64

### 3.3.2  離職率?

In [26]:
data['Attrition'].value_counts()

No     1233
Yes     237
Name: Attrition, dtype: int64

In [27]:
data['Attrition'].value_counts(normalize=True)

No     0.838776
Yes    0.161224
Name: Attrition, dtype: float64

In [28]:
attrition_rate=data['Attrition'].value_counts(normalize=True)['Yes']
attrition_rate

0.16122448979591836

### 平均時薪

In [29]:
data['HourlyRate'].mean()

65.89115646258503

### 平均工作年限

In [30]:
data['TotalWorkingYears'].describe()

count    1470.000000
mean       11.279592
std         7.780782
min         0.000000
25%         6.000000
50%        10.000000
75%        15.000000
max        40.000000
Name: TotalWorkingYears, dtype: float64

### 任職時間最長的員工

In [31]:
data['TotalWorkingYears'].sort_values(ascending=False)[:5]

EmployeeNumber
165     40
825     40
131     38
1824    37
112     37
Name: TotalWorkingYears, dtype: int64

In [32]:
data['TotalWorkingYears'].sort_values(ascending=False)[:5].index

Int64Index([165, 825, 131, 1824, 112], dtype='int64', name='EmployeeNumber')

### 整體員工滿意度

In [33]:
data['JobSatisfaction'].head()

EmployeeNumber
1    4
2    2
4    3
5    3
7    2
Name: JobSatisfaction, dtype: int64

In [34]:
JobSatisfaction_cat = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

In [35]:
data['JobSatisfaction']=data['JobSatisfaction'].map(JobSatisfaction_cat )
data['JobSatisfaction'].head()

EmployeeNumber
1    Very High
2       Medium
4         High
5         High
7       Medium
Name: JobSatisfaction, dtype: object

In [39]:
data['JobSatisfaction'].value_counts()

Very High    459
High         442
Low          289
Medium       280
Name: JobSatisfaction, dtype: int64

In [40]:
data['JobSatisfaction'].value_counts(normalize=True)

Very High    0.312245
High         0.300680
Low          0.196599
Medium       0.190476
Name: JobSatisfaction, dtype: float64

## 3.4 進一步思考

### 3.4.1 滿意度低的員工

In [42]:
data['JobSatisfaction'] == 'Low'

EmployeeNumber
1       False
2       False
4       False
5       False
7       False
        ...
2061    False
2062     True
2064    False
2065    False
2068    False
Name: JobSatisfaction, Length: 1470, dtype: bool

In [44]:
data.loc[data['JobSatisfaction'] == 'Low'].index

Int64Index([  10,   20,   27,   31,   33,   38,   51,   52,   54,   68,
            ...
            1975, 1980, 1998, 2021, 2023, 2038, 2054, 2055, 2057, 2062],
           dtype='int64', name='EmployeeNumber', length=289)

### 3.4.1 滿意度低和工作參與度低的員工

In [47]:
data['JobInvolvement'].head()

EmployeeNumber
1    3
2    2
4    2
5    3
7    3
Name: JobInvolvement, dtype: int64

In [49]:
# 進行轉換

JobInvolment_cat = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

data['JobInvolvement']=data['JobInvolvement'].map(JobInvolment_cat)
data['JobInvolvement'].head()

EmployeeNumber
1      High
2    Medium
4    Medium
5      High
7      High
Name: JobInvolvement, dtype: object

In [52]:
data.loc[(data['JobSatisfaction'] == 'Low') & (data['JobInvolvement'] == 'Low')].index

Int64Index([33, 235, 454, 615, 1019, 1037, 1237, 1460, 1478, 1544, 1611, 1622,
            1905, 1956],
           dtype='int64', name='EmployeeNumber')

### 3.4.3 員工比較

In [53]:
subset_of_interest = data.loc[(data['JobSatisfaction'] == "Low") | (data['JobSatisfaction'] == "Very High")]
subset_of_interest.shape

(748, 33)

In [55]:
subset_of_interest['JobSatisfaction'].value_counts()

Very High    459
Low          289
Name: JobSatisfaction, dtype: int64

In [56]:
grouped=subset_of_interest.groupby('JobSatisfaction')

In [57]:
grouped.groups

{'Low': Int64Index([  10,   20,   27,   31,   33,   38,   51,   52,   54,   68,
             ...
             1975, 1980, 1998, 2021, 2023, 2038, 2054, 2055, 2057, 2062],
            dtype='int64', name='EmployeeNumber', length=289),
 'Very High': Int64Index([   1,    8,   18,   22,   23,   24,   30,   36,   39,   40,
             ...
             2022, 2024, 2027, 2036, 2040, 2041, 2045, 2052, 2056, 2061],
            dtype='int64', name='EmployeeNumber', length=459)}

In [58]:
grouped.get_group('Low').head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
10,59,No,Travel_Rarely,1324,Research & Development,3,3,Medical,3,Female,...,1,80,3,12,3,2,1,0,0,0
20,29,No,Travel_Rarely,1389,Research & Development,21,4,Life Sciences,2,Female,...,3,80,1,10,1,3,10,9,8,8
27,36,Yes,Travel_Rarely,1218,Sales,9,4,Life Sciences,3,Male,...,2,80,0,10,4,3,5,3,0,3
31,34,Yes,Travel_Rarely,699,Research & Development,6,1,Medical,2,Male,...,3,80,0,8,2,3,4,2,1,3
33,32,Yes,Travel_Frequently,1125,Research & Development,16,1,Life Sciences,2,Female,...,2,80,0,10,5,3,10,2,6,7

In [59]:
grouped['Age']

In [60]:
grouped['Age'].mean()

JobSatisfaction
Low          36.916955
Very High    36.795207
Name: Age, dtype: float64

In [61]:
grouped['Age'].describe()

                 count       mean       std   min   25%   50%   75%   max
JobSatisfaction
Low              289.0  36.916955  9.245496  19.0  30.0  36.0  42.0  60.0
Very High        459.0  36.795207  9.125609  18.0  30.0  35.0  43.0  60.0

In [62]:
grouped['Age'].describe().unstack()

       JobSatisfaction
count  Low                289.000000
       Very High          459.000000
mean   Low                 36.916955
       Very High           36.795207
std    Low                  9.245496
       Very High            9.125609
min    Low                 19.000000
       Very High           18.000000
25%    Low                 30.000000
       Very High           30.000000
50%    Low                 36.000000
       Very High           35.000000
75%    Low                 42.000000
       Very High           43.000000
max    Low                 60.000000
       Very High           60.000000
dtype: float64

In [65]:
grouped['Department'].value_counts().unstack()

Department       Human Resources  Research & Development  Sales
JobSatisfaction
Low                           11                     192     86
Very High                     17                     295    147

In [66]:
100*grouped['Department'].value_counts(normalize=True).unstack()

Department       Human Resources  Research & Development      Sales
JobSatisfaction
Low                     3.806228               66.435986  29.757785
Very High               3.703704               64.270153  32.026144

In [70]:
grouped['DistanceFromHome'].describe()

                 count      mean       std  min  25%  50%   75%   max
JobSatisfaction
Low              289.0  9.190311  8.045127  1.0  2.0  7.0  14.0  29.0
Very High        459.0  9.030501  8.257004  1.0  2.0  7.0  14.0  29.0